#define _CRT_SECURE_NO_WARNING
#include <stdio.h>

/*
//1. 输出什么
int main()
{
	char a = -1;
	//10000000000000000000000000000001
	//
	//11111111111111111111111111111110
	//11111111111111111111111111111111    ：-1的补码就是全1
	//11111111  ：char类型只能存储8个bit位
	//char类型打印成整形要发生整形提升;整形提升按照原数的符号位
	//整形提升后：11111111111111111111111111111111
	//打印原码：10000000000000000000000000000001  -> -1
	signed char b = -1;
	//11111111

	unsigned char c = -1;
	//11111111
	//无符号位整形提升高位补0
	//整形提升后：00000000000000000000000011111111
	//正数的原反补码相同，打印后:255
	printf("a=%d,b=%d,c=%d", a, b, c);
	//打印整形
	//-1  -1   255
	return 0;
}
//输出结果：a=-1; b=-1; c=255
*/


/*
//2. 下面程序输出什么
int main()
{
	char a = -128;  //a=128 结果一样
	//10000000000000000000000010000000
	//11111111111111111111111101111111
	//11111111111111111111111110000000 - 补码
	//10000000
	//进行整数提升：11111111111111111111111110000000 - 补码
	//因为打印无符号数字，原码反码补码相同
	//所以还是打印：11111111111111111111111110000000
	printf("%u\n", a);

	//打印结果：4294967168
	return 0;
}
*/ 


//有符号的char的范围是：-128 --> 127
//无符号的char的范围是： 0 - 255
//%d - 打印十进制的有符号数字
//%u - 打印十进制的无符号数字


/*
int main()
{
	int i = -20;
	//10000000000000000000000000010100
	//11111111111111111111111111101011
	//11111111111111111111111111101100 - 补码
	//

	unsigned int j = 10;
	//00000000000000000000000000001010 - 补码   ；正数的原反补码相同

	printf("%d\n", i + j);
	//11111111111111111111111111101100
	//00000000000000000000000000001010
	//11111111111111111111111111110110   -  相加之后的结果 
	//11111111111111111111111111110101   
	//10000000000000000000000000001010  -   -10
	//按照补码的形式进行运算，最后格式化成为有符号整数
	return 0;
}
*/


/*
#include <windows.h>
int main()
{
	unsigned int  i;
	for (i = 9; i >= 0; i--)
	{
		printf("%u\n", i);
		Sleep(100); //睡眠函数（睡眠100ms）
	}
	//i永远为正不可能为负
	return 0;
}
*/



/*
int main()
{
	char a[1000];
	int i;
	for (i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;
	}
	printf("%d", strlen(a));
	return 0;
}
//输出结果：255
*/


/*
unsigned char i = 0;
int main()
{
	for (i = 0; i <= 255; i++)
	{
		printf("hello world\n");
	}
	return 0;
} //死循环
*/
